In [1]:
import numpy as np 
import pandas as pd

In [3]:
data = {
    'Year': [2021, 2021, 2021, 2021, 2022, 2022, 2022, 2022],
    'Quarter': ['Q1', 'Q2', 'Q3', 'Q4', 'Q1', 'Q2', 'Q3', 'Q4'],
    'Sales_Online': [20000, 25000, 23000, 24000, 26000, 27000, 28000, 29000],
    'Sales_InStore': [30000, 32000, 31000, 33000, 34000, 35000, 36000, 37000],
    'Expenses_Online': [15000, 16000, 15500, 16500, 17000, 17500, 18000, 18500],
    'Expenses_InStore': [20000, 21000, 20500, 21500, 22000, 22500, 23000, 23500]
}

In [5]:
financial_data=pd.DataFrame(data)

In [7]:
financial_data

,Year,Quarter,Sales_Online,Sales_InStore,Expenses_Online,Expenses_InStore
0,2021,Q1,20000,30000,15000,20000
1,2021,Q2,25000,32000,16000,21000
2,2021,Q3,23000,31000,15500,20500
3,2021,Q4,24000,33000,16500,21500
4,2022,Q1,26000,34000,17000,22000
5,2022,Q2,27000,35000,17500,22500
6,2022,Q3,28000,36000,18000,23000
7,2022,Q4,29000,37000,18500,23500

In [11]:
online_sales_q1_2022 = financial_data[(financial_data['Year'] == 2022) & (financial_data['Quarter'] == 'Q1')]['Sales_Online'].values[0]

In [13]:
online_sales_q1_2022

26000

In [15]:
instore_expenses_q3_2021 = financial_data[(financial_data['Year'] == 2021) & (financial_data['Quarter'] == 'Q3')]['Expenses_InStore'].values[0]

In [17]:
instore_expenses_q3_2021

20500

In [19]:
total_sales_q4_2021 = financial_data[(financial_data['Year'] == 2021) & (financial_data['Quarter'] == 'Q4')][['Sales_Online', 'Sales_InStore']].sum().sum()

In [21]:
total_sales_q4_2021

57000

In [23]:
expenses_online_2022 = financial_data[financial_data['Year'] == 2022]['Expenses_Online'].sum()

In [25]:
expenses_online_2022

71000

In [27]:
sales_q2_2021 = financial_data[(financial_data['Year'] == 2021) & (financial_data['Quarter'] == 'Q2')][['Sales_Online', 'Sales_InStore']]

In [29]:
sales_q2_2021

   Sales_Online  Sales_InStore
1         25000          32000

In [31]:
max_expense_2022 = financial_data[financial_data['Year'] == 2022][['Expenses_Online', 'Expenses_InStore']].max().max()

In [33]:
max_expense_2022

23500

In [41]:
financial_data.stack

<bound method DataFrame.stack of    Year Quarter  Sales_Online  Sales_InStore  Expenses_Online  \
0  2021      Q1         20000          30000            15000
1  2021      Q2         25000          32000            16000
2  2021      Q3         23000          31000            15500
3  2021      Q4         24000          33000            16500
4  2022      Q1         26000          34000            17000
5  2022      Q2         27000          35000            17500
6  2022      Q3         28000          36000            18000
7  2022      Q4         29000          37000            18500

   Expenses_InStore
0             20000
1             21000
2             20500
3             21500
4             22000
5             22500
6             23000
7             23500  >

In [47]:
data = {
    'Store': ['Store_A', 'Store_A', 'Store_A', 'Store_B', 'Store_B', 'Store_B', 'Store_C', 'Store_C', 'Store_C'],
    'Product': ['Product_1', 'Product_2', 'Product_3', 'Product_1', 'Product_2', 'Product_3', 'Product_1', 'Product_2', 'Product_3'],
    'Sales': [100, 150, 200, 110, 160, 210, 120, 170, 220]
}
df = pd.DataFrame(data)

In [49]:
stacked_df = df.set_index(['Store', 'Product']).stack().reset_index()
stacked_df.columns = ['Store', 'Product', 'Metric', 'Value']

In [51]:
stacked_df

     Store    Product Metric  Value
0  Store_A  Product_1  Sales    100
1  Store_A  Product_2  Sales    150
2  Store_A  Product_3  Sales    200
3  Store_B  Product_1  Sales    110
4  Store_B  Product_2  Sales    160
5  Store_B  Product_3  Sales    210
6  Store_C  Product_1  Sales    120
7  Store_C  Product_2  Sales    170
8  Store_C  Product_3  Sales    220

In [53]:
unstacked_df = stacked_df.set_index(['Store', 'Product', 'Metric']).unstack(level=0)
unstacked_df

                   Value
Store            Store_A Store_B Store_C
Product   Metric
Product_1 Sales      100     110     120
Product_2 Sales      150     160     170
Product_3 Sales      200     210     220

In [55]:
employee_data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Role': ['Manager', 'Assistant', 'Manager', 'Developer', 'Manager', 'Analyst'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank']
}

In [57]:
employee_df = pd.DataFrame(employee_data)
employee_df.set_index(['Department', 'Role'], inplace=True)
employee_df

                     Employee
Department Role
HR         Manager      Alice
           Assistant      Bob
IT         Manager    Charlie
           Developer    David
Finance    Manager        Eve
           Analyst      Frank

In [59]:
it_employees = employee_df.loc['IT']
it_employees

          Employee
Role
Manager    Charlie
Developer    David

In [61]:
grades_data = {
    'Student': ['John', 'Alice', 'Bob', 'David'],
    'Subject': ['Math', 'Math', 'Science', 'Science'],
    'Grade': [88, 92, 85, 90]
}

In [63]:
grades_df = pd.DataFrame(grades_data)
sorted_grades_df = grades_df.sort_values(by=['Subject', 'Grade'])
sorted_grades_df

  Student  Subject  Grade
0    John     Math     88
1   Alice     Math     92
2     Bob  Science     85
3   David  Science     90

In [65]:
reset_sorted_grades_df = sorted_grades_df.reset_index(drop=True)
reset_sorted_grades_df

  Student  Subject  Grade
0    John     Math     88
1   Alice     Math     92
2     Bob  Science     85
3   David  Science     90

In [69]:
weather_data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Temperature': [5, 6, 7],
    'Humidity': [80, 75, 78]
}
weather_df = pd.DataFrame(weather_data)
weather_df.set_index('Date', inplace=True)
weather_df

            Temperature  Humidity
Date
2023-01-01            5        80
2023-01-02            6        75
2023-01-03            7        78

In [75]:
product_sales_data = {
    ('Category_A', 'Product_1'): [100],
    ('Category_A', 'Product_2'): [150],
    ('Category_B', 'Product_1'): [200],
    ('Category_B', 'Product_2'): [250]
}

In [79]:
product_sales_df = pd.DataFrame(product_sales_data)

In [81]:
flattened_product_sales_df = product_sales_df.stack().reset_index()

C:\Users\riyan\AppData\Local\Temp\ipykernel_23248\652589773.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  flattened_product_sales_df = product_sales_df.stack().reset_index()

In [85]:
flattened_product_sales_df = product_sales_df.stack().reset_index()

C:\Users\riyan\AppData\Local\Temp\ipykernel_23248\1128012341.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  flattened_product_sales_df = product_sales_df.stack().reset_index()

In [89]:
flattened_product_sales_df.columns = ['Index', 'Category_Product', 'Sales']
flattened_product_sales_df

ValueError: Length mismatch: Expected axis has 4 elements, new values have 3 elements

In [91]:
product_data = {
    ('Category_A', 'Product_1'): [100, 110],
    ('Category_A', 'Product_2'): [150, 160],
    ('Category_B', 'Product_1'): [200, 210],
    ('Category_B', 'Product_2'): [250, 260]
}

In [93]:
product_df = pd.DataFrame(product_data)

In [95]:
product_df.columns.names = ['Category', 'Product']

In [97]:
average_product_df = product_df.mean()

In [99]:
average_product_df

Category    Product
Category_A  Product_1    105.0
            Product_2    155.0
Category_B  Product_1    205.0
            Product_2    255.0
dtype: float64